## Ch 5. pandas

In [2]:
import pandas as pd
import numpy as np

In [17]:
from pandas import Series, DataFrame

### Ch. 5.1 pandas data structure

#### Series

In [20]:
obj = pd.Series([4, 7, -5, 3])

In [21]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [22]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [23]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])

In [25]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [26]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [27]:
obj2['a']

-5

In [28]:
obj2['d'] = 6

In [29]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [30]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [31]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [32]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [33]:
'b' in obj2

True

In [34]:
'e' in obj2

False

In [3]:
sdata = {'Ohio': 35000, 'Texas': 711000, 'Oregon': 16000, 'Utah': 5000}

In [4]:
obj3 = pd.Series(sdata)

In [5]:
obj3

Ohio       35000
Texas     711000
Oregon     16000
Utah        5000
dtype: int64

In [6]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [7]:
obj4 = pd.Series(sdata, index = states)

In [9]:
obj4

California         NaN
Ohio           35000.0
Oregon         16000.0
Texas         711000.0
dtype: float64

In [10]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [11]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [12]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [13]:
obj3

Ohio       35000
Texas     711000
Oregon     16000
Utah        5000
dtype: int64

In [14]:
obj4

California         NaN
Ohio           35000.0
Oregon         16000.0
Texas         711000.0
dtype: float64

In [15]:
obj3 + obj4

California          NaN
Ohio            70000.0
Oregon          32000.0
Texas         1422000.0
Utah                NaN
dtype: float64

In [16]:
obj4.name = 'population'

In [17]:
obj4.index.name = 'state'

In [18]:
obj4

state
California         NaN
Ohio           35000.0
Oregon         16000.0
Texas         711000.0
Name: population, dtype: float64

In [35]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [36]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [37]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

#### DataFrame

In [38]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [39]:
frame = pd.DataFrame(data)

In [40]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [41]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [42]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [43]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], index = ['one', 'two', 'three', 'four', 'five', 'six'])

In [44]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [45]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [46]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [47]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [48]:
frame2['debt'] = 16.5

In [49]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [51]:
frame2['debt'] = np.arange(6.)

In [52]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [53]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])

In [54]:
frame2['debt'] = val

In [55]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [56]:
frame2['eastern'] = frame2.state == 'Ohio'

In [57]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [58]:
del frame2['eastern']

In [60]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [61]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [62]:
frame3 = pd.DataFrame(pop)

In [63]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [64]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [66]:
pd.DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [67]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}

In [68]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

#### Index Object

In [71]:
obj = pd.Series(range(3), index = ['a', 'b', 'c'])

In [72]:
index = obj.index

In [74]:
index

Index(['a', 'b', 'c'], dtype='object')

In [75]:
index[1:]

Index(['b', 'c'], dtype='object')

In [76]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [77]:
labels = pd.Index(np.arange(3))

In [79]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [80]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)

In [82]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [84]:
obj2.index is labels

True

In [86]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [87]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [88]:
'Ohio' in frame3.columns

True

In [89]:
2003 in frame3.columns

False

In [91]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [92]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')